{
    "everyDay": "Every day, millions of people search for movies online, and no one wants it to be complicated - and you are certainly no different! If so, Ivi is the ultimate source you need. Best movies in HD quality are literally one click away from you. We not only free you from the need to go to the cinema or study TV program guides – we also offer our users many more opportunities.",
    "videoLibrary": "Ivy's video library is a constantly growing collection in RuNet, which has more than 60 thousand domestic and international movies and TV series available for viewing online. We were the first company in Russia to sign contracts with the largest Hollywood studios (Walt Disney, Warner Bros., Sony, 20th Century Fox, Universal, Paramount, MGM and others) and we constantly cooperate with the largest Russian companies and TV channels.",
    "onlineCinemaIvi": "Online Cinema Ivi is:",
    "uniqueRecommendation": "the unique recommendation system that takes into account your preferences and suggests you to watch what you will definitely enjoy;",
    "oneTouch": "one-touch watching on any of the devices connected to your Ivi account - from smartphones to TVs with Smart TV technology;",
    "opportunityToDownload": "the opportunity to download licensed content to the memory of your mobile device and watch it without access to the Internet;",
    "uniqueConditions": "unique conditions and benefits for the owners of the Ivi subscription, which makes watching comfortable and enjoyable;",
    "advancedNotification": "advanced notification system: you will not miss the release of a new blockbuster - we will notify you when it’s released in a way suitable for you;",
    "opportunityToAdd": "the opportunity to add movies to the \"watch later\" page to return to them when you have time;",
    "content": "content that does not require installing video players or codecs to watch it;",
    "watchingOnlineContent": "watching online content in good resolution without registration or SMS.",
    "discoverOpportunity": "Discover the opportunity to watch movies online for free in excellent quality with Ivi!",
    "onlineCinema": "Online Cinema Ivi: good quality movies always bring real pleasure",
    "expand": "Expand",
    "hide": "Hide",
    "thirtyDays1Rouble": "30 days subscription for 1 ₽",
    "activateCertificate": "Activate certificate"
}
