import React, { useState } from 'react'
import styles from './MoviesHead.module.scss'

const MoviesHead = () => {
    const [isOpen, toggleIsOpen] = useState(false)

    return (
        <div className={styles.moviesHead}>
            <div className="container">
                <div className={styles.moviesHead__wrapper}>
                    <h1>Фильмы смотреть онлайн</h1>
                    {!isOpen && (
                        <p>
                            Вы любите смотреть фильмы онлайн и проводите много
                            времени, прочесывая сайты в поисках чего-нибудь
                            интересного? Стоит задержаться на ivi.ru – фильмов,
                            которые собраны у нас, вам хватит надолго. Коллекция
                            постоянно пополняется как...
                        </p>
                    )}
                    {isOpen && (
                        <p>
                            Вы любите смотреть фильмы онлайн и проводите много
                            времени, прочесывая сайты в поисках чего-нибудь
                            интересного? Стоит задержаться на ivi.ru – фильмов,
                            которые собраны у нас, вам хватит надолго. Коллекция
                            постоянно пополняется как новыми фильмами, так и
                            признанными шедеврами прошлых лет! Независимо от
                            того, кто вы – любитель энергичных боевиков или
                            поклонница молодежных сериалов, изобилие нашего
                            каталога заставит вас забыть обо всех других
                            способах проведения досуга, и вы будете
                            пересматривать любимые фильмы онлайн снова и снова!
                            Выбор фильмов очень широк и многообразен, так что
                            каждый найдет для себя что-то интересное, каким бы
                            ни были его вкусы. Предпочитаете картины
                            исключительно зарубежного производства? У нас их
                            предостаточно: это и золотая классика Голливуда, и
                            душевные французские комедии, и темпераментные
                            итальянские драмы, и шумные индийские музыкальные
                            фильмы. А может, вы патриот и любите российские
                            фильмы? Что ж, и таких фильмов у нас немало. Что вам
                            больше по вкусу – добрая старая классика или новинки
                            кинопроката? Неважно, каким будет ваш ответ – у нас
                            есть все, как картины эпохи зарождения
                            кинематографа, так 2018 года и фильмы 2017. В нашем
                            каталоге вы найдете любые жанры. Это и фильмы про
                            любовь, и детективы, и боевики, и вестерны, и
                            фантастика, и арт-хаус, и уморительные комедии, и
                            фильмы про войну, и ужасы, и триллеры, и
                            документалистика... Кроме «полного метра» на сайте
                            представлены также короткометражные фильмы, а также
                            иностранные и русские сериалы. Если вас интересуют
                            самые знаковые фильмы онлайн в том или ином жанре,
                            система рубрикации поможет вам без труда
                            сориентироваться и найти, например, лучшие драмы или
                            лучший анимационный фильм онлайн. Не упустите
                            замечательную возможность смотреть фильмы онлайн без
                            регистрации, выбирая только то, что вам
                            действительно интересно, и тогда, когда вам это
                            удобно. Ведь это так просто и приятно!
                        </p>
                    )}
                    {isOpen ? (
                        <span onClick={() => toggleIsOpen(false)}>
                            Свернуть
                        </span>
                    ) : (
                        <span onClick={() => toggleIsOpen(true)}>
                            Развернуть
                        </span>
                    )}
                </div>
            </div>
        </div>
    )
}

export default MoviesHead
