const data = {
    id: 87,
    name: 'Мятеж',
    type: 'tv-series',
    rating: '6.939',
    description:
        '1921-й год. Лиза Журавлёва задержана ЧК по обвинению в организации Ярославского мятежа. Следователь Воронов понимает, что ради спасения маленького сына Лиза расскажет всё. Её показания, по сути, оказываются историей любви на фоне Первой мировой, революции, гражданской войны. Историческая мясорубка перемалывает любовь Лизы к бедному курсанту Сычёву, её ненависть к распущенному капитану Крушевскому, за которого её силой отдали замуж, полностью меняет отношения между героями. Рассказ Лизы заставляет Воронова переосмыслить свои представления о революции и справедливости.',
    slogan: null,
    poster: 'https://st.kp.yandex.net/images/film_big/1006538.jpg',
    previewPoster:
        'https://st.kp.yandex.net/images/film_iphone/iphone360_1006538.jpg',
    year: 2020,
    director: 'Сергей Пикалов',
    genre: [
        { id: 6, name: 'драма' },
        { id: 11, name: 'история' },
    ],
}

export default data
